In [1]:
import pandas as pd

In [2]:
file = pd.read_csv("../data/nyc_taxi_2019-01.csv",
                   sep= ",",
                   usecols=['passenger_count','trip_distance','total_amount','payment_type'],
                   header= 0)

In [3]:
df = pd.DataFrame(file)
df.head()

   passenger_count  trip_distance  payment_type  total_amount
0                1            1.5             1          9.95
1                1            2.6             1         16.30
2                3            0.0             1          5.80
3                5            0.0             2          7.55
4                5            0.0             2         55.55

### how many taxi rides had more then eight passengers?

In [4]:
df['passenger_count'][df['passenger_count'] > 8].count()

np.int64(9)

### how many taxi rides had zero pessengers

In [5]:
df['passenger_count'][df['passenger_count'] == 0].count()

np.int64(117381)

### How many taxi rides were paid for in cash and cost over $1,000?

In [6]:
df.loc[((df['total_amount' ]> 1000) & (df['payment_type'] == 2)) , ['total_amount']].count()

total_amount    5
dtype: int64

### How many rides cost less than $0?

In [7]:
df.loc[df['total_amount' ] < 0, 'total_amount'].count()

np.int64(7131)

### How many rides traveled a below-average distance but cost an above-average amount?

In [8]:
df[df['trip_distance'] < df['trip_distance'].mean()]

         passenger_count  trip_distance  payment_type  total_amount
0                      1           1.50             1          9.95
1                      1           2.60             1         16.30
2                      3           0.00             1          5.80
3                      5           0.00             2          7.55
4                      5           0.00             2         55.55
...                  ...            ...           ...           ...
7667785                1           1.45             1         14.16
7667788                1           0.00             1          0.00
7667789                1           0.00             1          0.00
7667790                1           0.00             1          0.00
7667791                1           0.00             1          0.00

[5757271 rows x 4 columns]

In [9]:
df[df['total_amount'] > df['total_amount'].mean()]

         passenger_count  trip_distance  payment_type  total_amount
1                      1           2.60             1         16.30
4                      5           0.00             2         55.55
6                      5           0.00             2         55.55
8                      1           3.70             1         18.50
10                     2           2.80             1         19.55
...                  ...            ...           ...           ...
7667779                1           7.50             1         26.80
7667782                3           8.14             1         34.80
7667783                2           4.15             2         15.80
7667786                2           4.28             1         21.96
7667787                1           4.79             1         23.16

[2147320 rows x 4 columns]

In [10]:
df.loc[(df['trip_distance'] < df['trip_distance'].mean()) &(df['total_amount'] > df['total_amount'].mean()), 'trip_distance'].count()

np.int64(411255)

### How many rides that cost less than $0 involved either a dispute (payment_type of 4) or a voided trip (payment_type of 6)?

In [11]:
df.loc[(df['total_amount' ] < 0) & ((df['payment_type'] == 4) | (df['payment_type'] == 6)) ].count()

passenger_count    2666
trip_distance      2666
payment_type       2666
total_amount       2666
dtype: int64

### I stated earlier that most people pay for taxi rides using a credit card. Show this, and find what percentage normally pays in cash versus a credit card.

In [12]:
df['payment_type'].value_counts(normalize= True)

payment_type
1    0.715464
2    0.278752
3    0.004328
4    0.001456
Name: proportion, dtype: float64